[
    {
        "id": 1,
        "question": "Okay gang, I know my wife can't be the only one to suffer constipation from her chemo. What has everyone done to help relieve this.",
        "comment": ["Miralax as a softener a couple times a day. Milk of Magnesia mixed with prune juice warmed up can be effective within a few hours. An RX from her doctor for Lactulose will certainly get things moving. But its a continuous battle that she will have to stay on top of.", "Hot oatmeal with dried plums helps my mom. They also have her on colace twice a day.", "Miralax 3 x a day and 1 senecot twice a day, this is what dr told us to do. Sometimes we give 2 senecot twice a day. Senecot is vegetable base laxative and stool softener so very gentle. This has worked for us she is consistent. If diarrhea starts cut back."],
        "date": "10/7/19"
    },
    {
        "id": 2,
        "question": "What can I buy for very fast relief of constipation please?",
        "comment": ["Hot prune juice. Make sure its 100% juice and heat it till its about the temp of coffee. Should work within minutes", "My mom used senokot-s. Now uses lax a day."],
        "date": "3/7/19"
    },
    {
        "id": 3,
        "question": "My husband is on pain meds for nsc lung cancer. He is having lots of problems with constipation. He is taking Colace & Senna. Any recommendations for more help? He has not gone in a week now.",
        "comment": ["Magnesium sulfate he can drink it and it will take effect fast any drug store carry’s it"],
        "date": "12/13/17"
    },
    {
        "id": 4,
        "question": "What is the Best medicine for constipation after chemo",
        "comment": ["2 tablespoons of milk of magnesia in 6 ounces of prune juice. It worked very well for my husband.", "Pharmacist recommended something like Senokot...I chose the Walgreens brand. Unfortunately it takes 6-12 hours to work. But is suppose to be really good as a laxative & softer."],
        "date": "10/14/17"
    },
    {
        "id": 5,
        "question": "I have a question been doing radiation for 14 days and chemo 3 days last week so now I am so constipated also on steroids what is good for me to buy for that thanks",
        "comment": ["Warm prune juice with a pat of butter.", "You can try Senna-S . It was recommended for David by his doctors when he went through treatment. It worked well and I know of many of my patients that are in pain management use it too."],
        "date": "2/23/19"
    },
    {
        "id": 6,
        "question": "Has anyone experienced diarrhea from Keytruda? This is my first side effect in a year and half and it’s been working so well.",
        "comment": ["Call your dr. It’s on the list of symptoms to watch out for. It could mean that your immune system might be attacking your colon so they want to know."],
        "date": "3/1/18"
    },
    {
        "id": 7,
        "question": "My mom is on the 21 day schedule for chemo. She goes again the 27th of this month. She has nsclc that has metastasized into the bone. This is her 2nd go round with cancer. My question is...she is having diarrhea that looks like oil or greasy. Did anyone else have this symptom? If so what did you do and what caused it? It is making her sick.",
        "comment": ["It is likely the chemo causing it. It is hard on the digestive system. I would suggest getting her some Imodium AD. Works well for me."],
        "date": "8/21/19"
    },
    {
        "id": 8,
        "question": "Advice on how to stop stomach pain, and diarrhea after chemptherapy?",
        "comment": ["My partner was given medication to help with loose stools while he was on IV chemo. He’s taking oral chemo now and Imodium AD worked wonders! If it’s not available where you live most anti-diarrhea medications should work. Any questions, ask your doctor. Have him drink plenty of water to keep hydrated days before, during and days after treatment."],
        "date": "8/22/19"
    },
    {
        "id": 9,
        "question": "My mum is facing constipation issue for past 5 days, what should I do?",
        "comment": ["Milk of mag. Worked for my husband, he didn't follow the directions and took two big swigs, plus plenty of water. Helped within hours", "My husband has had success with the magnesium citrate drink available over the counter at any pharmacy"],
        "date": "5/3/18"
    },
    {
        "id": 10,
        "question": "Anyone have a great constipation treatment...5 days without going. Today have taken 2 senna pills, 3 doses of miralax. Senna and miralax every day prior. Wont take magnesium citrate..causes vomiting.",
        "comment": ["Suppositories work wonders for when you just cant go"],
        "date": "3/26/19"
    },
    {
        "id": 11,
        "question": "My husband has lost so much weight that he has no fat round his bum. He is badly constipated and hasn’t been for 6 weeks. I’m sorry if this is not nice but he had hard poo and sitting laying he is in pain. His just come out of hospital and been on 3 laxative. Help any advice please.",
        "comment": ["There are alots of things to give him but please find out first if he has a blockage. If he doesn't they recommend MiraLax or warm prune juice with butter. That's so painful. I hope they can find something to help him."],
        "date": "8/3/19"
    },
    {
        "id": 12,
        "question": "Has anyone experienced sickness and diarrhea why on immunotherapy ?",
        "comment": ["Hubby had terrible diarrhoea on keytruda. Had to have large dose of steroids to stop it."],
        "date": "4/29/19"
    },
    {
        "id": 13,
        "question": "My husband has been feeling very ill (it hit him all of a sudden) since about 11 a.m. today. His first Keytruda treatment was August 13th & his 2nd is scheduled for September 5th. He was doing pretty well, just a bit more tired & a few boughts of diarrhea randomly...until now. (Sorry if TMI.) Could the Keytruda be affecting him all of a sudden like this? He doesn't have a fever, but says his stomach hurts & he's very weak. He barely moves off the bed or couch anymore, so not sure if weakness is from lack of moving or from the metastasized bone cancer progressing. ",
        "comment": ["One of the side affects of Keytruda is the diarrhea, you should go and checked out and let the Dr. know. I had my reaction onThanksgiving and couldn’t eat until I received anti-diarrhea meds."],
        "date": "8/31/19"
    },
    {
        "id": 14,
        "question": "My mothers curious, how many of you patients or caregivers have noticed extreme hair loss or thinning using Gemzar?Her doctors are saying it’s hopefully going to be minimal but my moms all worried about it",
        "comment": ["Mom's doctor told us the chemo (not gemzar) would 'thin' her hair. Nope. Wiped it our completely in 3 days. After the second or third treatment. I wish we had gone to the wig stylist while mom still had her hair. She did a good job from pictures but it would have been easier to do sooner. Just my 2 cents. (Mom was very concerned about the hair loss. Said 'why does that bother me more than the cancer?' I reassured her that was ok to feel that way)", "My moms worried about her hair a lot too though it might seem trivial too me I get it she’s trying to keep all normalcy possible", "yes, probably. And it's a constant reminder of their illness, to themselves and others. Now my mom is so used to the little caps she isn't wearing the wig at all. But her friend who had cancer treatment told us how the wigs were easier...just pop one on, no worries! Hair all styled!"],
        "date": "8/16/19"
    },
    {
        "id": 15,
        "question": "For those who didn't lose all your hair, but hair became very, very thin, did it all grow back in? How was the growing out stage with new growth mixed in w/ existing, longer hair? Or, did your hair remain really thin after chemo? Did anyone's hair get so thin you opted to shave it? Please share your experience if you dealt with extreme thinning vs complete hair loss.",
        "comment": ["Mom's suddenly started coming out in clumps. Almost, but not quite, gone in a matter of 2 days. She got, well, pissed and made an appointment tho have the rest shaved the next day. It's starting to grow back. Just as white as when she shaved. Right now, she looks just like my sister as a baby. Sticking straight up on top. Still thin, though. Luckily, she's able to laugh about it...because she looks like one of the minions. I'm glad she finds it comical because there sure isn't anything else funny right now", "I decided to shave mine. It was the only thing I had control over. It was the best decision I made", "My hair thinned but I have extremely thick hair so it doesn’t show I have new growth coming in so it is going to be interesting when it gets longer and mixing in with the existing hair. It is coming in black. I have blond/ gray hair", "Mine came out, but was very thin. I never had it shaved off. It was cut in a bob style at this point. I finally went in and had it cut into a pixie cut, very short but stylish. That was about 8 months ago. It has grown back in very thick. I still keep it short.", "Mine got really thin and now 6-7 months later coming in much thicker and so curly it’s unmanageable.... same color though...", "I am 70 years old and have always had thick hair. After one chemo treatment mine started falling out in big clumps. I had my head shaved. Lol, my first thought was I look like a wrinkled baby. But then my husband took me to Wal-Mart to buy womens baseball caps. And I bought some chemo hats on line...french beret and newsboy hats. As much as it hurt to lose my hair I'm fortunate it grows fast. Coming back white as it was but texture feels wiry. Hope that changes. It is what it is. My focus and bigger challenge is defeating this cancer.", "you were ok with the bald look, they were talking about one drug and Dr said you lose hair and I freaked. It’s just me I think. Was it taxol that you had.? It’s nice what your husband did. I don’t have one anymore.", "Yes it's the Taxol. I'm having 7 chemo treatments of weekly Taxol and Carboplatin on Mondays and 35 days of radiation Monday through Friday concurrently. I was shocked when the hair loss occurred on the first chemo. I have NSCLC squamous cell carcinoma stage 3. My goal is to ultimately have an ULL lobectomey. The tumor is 6 cm with suspect lymph node. My radiologist told me it is shrinking and I still have 3 weeks of treatments. I have accepted the hair loss and realized it was a minor problem in the scheme of defeating and recovering from this cancer.", "I am on Carbo/ Alimpta, when I was first dx July 2016!was supposed to have surgery but it never happened since I had Chemo 4 treatments of Altima/ Carbo and daily 36 radiation treatments to the chest. A couple of the main tumors were too close to Aorta so that's why I had the chemo but since I had good response and everything turned to scare tissue no surgery. Since I was EGFR positive at the time I was on Tagrissio for 13 months until I recently had progression which was seen in Dec 6th scans. After blood biopsies we found I am no longer EGFR positive so I stoped the drug ( which killed my appetite the whole time) lost too much weight. Had to start Chemo very 3 weeks first one was Jan 10th, I just had another on Jan 31 and the next one Is Feb. 21 they will will ongoing as I was told. I do have stage 4 since it went in couple of bones as well. I think after the 4 th treatment I will get scared. Reason I was asking about the taxol , last visit my Dr told me my liver enzymes were slightly elevated and Dr said if it continues I would be switched to taxol where you would lose your hair. I also look up all these drugs. What I am in last time my hair thinned but not that bad, a year ago inhadbSBRT radiation to cervical spine and lost 2 rounds patches of hair ( one in left side, one of rift side) it wasn't that noticeable they way I wear my hair. The hair got burnt from the radiation but it did work. Just thinking about the total hair loss just freaked me out. ( yes I know it's hair) but I think I would have a hard time looking at myself, it's just me, I was scared hearing it. They said with taxol it goes by first or sec treatment. They do have really nice wigs out but I think I would be so afraid to look at myself with no hair. When I go to chemo there are some people who go in with bald heads and I get scared seeing that.( I guess it's a fear of mine) I was supposed to be getting a port installed tomm ( tues) but we are having a storm ( good old New York) so procedure is scheduled for Fri now. This is another thing I am petrified off, but I couldn't stall any longer since they said I am getting my veins destroyed. Were you ok when you saw yourself with the no hair? Get a nice wig to go out would probably make you feel better, however it's up to you. It would be great when you are able to have surgery as I was unable to since you can't get cancer there again. I have been treated with gamma knife radiation to the brain already in Aug 2017. It's been a wild ride. BTW I am 10'years younger than you. Do you get steroids as well? I do and the sweats at night for at least a week are no picnic.", "the drug I'm on that causes hair loss is Navalbine, but low enough dosage that it wasn't likely to lose hair, just get thin. But it's horribly thin.", "the reason I think I am scared of total hair loss is that it will be a constant reminder about the cancer as sometimes I try to put it out of my head( it's a mental thing I guess with me)", "the reason I think I am scared of total hair loss is that it will be a constant reminder about the cancer as sometimes I try to put it out of my head( it's a mental thing I guess with me)", "My mom lost probably about 40-50% of her hair... she just cut hers really short to cover how thin it was. The hair that grew back was brown, which was funny considering she was completely white headed!", "wow!! I heard when u lose hair it usually comes back diff colors and or textures."],
        "date": "2/11/19"
    },
    {
        "id": 16,
        "question": "With my mama starting treatment here shortly we'd like to be prepared for one of the many cons which is hair loss. What site have you used for wigs, head wraps, ECT? Is there a special store for patients that is considered more affordable?",
        "comment": ["The American Cancer society"],
        "date": "2/1/19"
    },
    {
        "id": 17,
        "question": "I've had 4 chemo treatments in the last 4 weeks and no hair loss yet. One of my drugs can cause it, the other doesn't. Today I noticed one sore spot on my scalp. Now several hours later, I have 3 sore spots that are all very tender. I haven't read that a sore scalp alone is a side effect. Is this a sign that hair loss is coming?",
        "comment": ["My mom had cisplatin and and alimita and she didn't lose her hair and I think it was the cisplatin that had the possibility of this happening", "My husband started losing his hair in clumps after about two weeks of chemo. He experienced a terrible itching feeling but not necessarily soreness."],
        "date": "12/17/18"
    },
    {
        "id": 18,
        "question": "My husbands scalp is tingling a lot. Is that a precursor to hair loss or just a chemo side effect?",
        "comment": ["Precursor to hair loss most likely. It can itch and burn as well", "Neuropathy, it's a chemo side effect.", "You will know if his hair starts falling out. When mine fell out it was a tingly scalp first", "My mom's head itches a lot Get antihistamines and use shampoo and conditioner with no sulpha in them, it helps a lot", "She doesn't need the antihistamines everyday. It itches maybe 50% of the time, but it definitely helps. And also sorbolene cream for itchy skin if it starts", "Mine was same way. I had 6 rounds of chemo then moved into chemo and keytruda combo. Have been in treatment for over a year.. My hair started to thin somewhat, but now it is definitely starting to fall out... Really thght I was gonna keep it considering it had been over a year"],
        "date": "4/15/18"
    },
    {
        "id": 19,
        "question": "Our journey started 6 months ago with the discovery of a large brain tumor. Stage4 Adenocarcinoma Lung cancer, Mets to brain and mediastinum. Craniotomy and targeted brain radiation tolerated extremely well. 5 rounds of Carbo/Alimta/keytruda tolerated extremely well. Only mild fatigue. He had voracious hunger and gained 15 pounds. His chest tumors shrunk 40%. We were sailing!!Recent follow up MRI showed many small new Mets to brain so undergoing Whole Brain Radiation therapy. Currently at 8 of 12. And boom, his appetite is totally gone. Probably down 10 pounds already. Anyone with similar story? I would like to understand if it’s the radiation, cumulative chemo, or cancer, and if the hunger returns?",
        "comment": [" My husband lost his appetite 6 weeks ago, the nurse said two weeks as it was a sign, please hear my husband cancer and prognosis is not your husband's. This rocked us, and my husband started drinking boost, 5 a day, now he has more energy and is doing better, he hasn't eaten anything but the boost is helping him.", "My hubs has just finished 10 sessions condensed into two days. No appetite at all, except for ice cream."],
        "date": "10/13/19"
    },
    {
        "id": 20,
        "question": "Does anyone know anything that will help with appetite?",
        "comment": ["Dr just prescribed megace to my husband yesterday. Not sure yet if it works though", "Edibles also helps pain i have lung brain and tumor in my leg havent taken a pain pill yet", "I think edibles will help quite a bit. However with the chemo that’s one of the side effects is losing the taste of your food.", "My doc suggested medical marijuana.", "Medical marijuana, edibles like the others said. Works great for my wife. Rso really helps with her pain and appetite. She has stage 4 lung cancer with Mets everywhere.", "She is close to one gram of rso per day and all I can say is what I see. She is still losing weight but I blame that on the keyteuda and what it does to her taste and sores in her mouth. With the rso she eats so much more then before the rso. She is up all day long like normal and she is doing everything that she loves to do. In August I thought I would lose her very soon, she was taking rso but only about two grains of rice size and she would only take it if I begged her. Now she takes it all the time and it is like she was before the cancer. She is doing very well but I do not know what her tumors are like because we have not had a pet scan since April. I just know that this is the best she has been.", "I go through stages where I dont eat. Last one lasted 2 mths. Drink a lot of protein drinks and shakes it shall pass. Then watch out they will eat like a horse", "Dronabinol. My mother was just prescribed. Derived from marijuana. Hope it helps.", "Marinol", "Cannabis", "Megestrol Acetate Oral Suspension USP 40 mg/mL", "My dad says Megestrol Acetate oral suspension doesn't have much of a taste. After the 3rd day he started feeling hungry again! Hes only been on it a week but we can already tell a difference", "Medical Marijuana has helped me a lot. Legal in my state(Il). If you are on chemo make sure it doesn't have cbd. I was told the cbd and chemo don't work together. I get Gummies(edibles) with the highest thc content available. The folks at my dispensary are very helpful with this. Ate more than I have in weeks.", "Yes my mom used different foods to help. We put the information in a booklet to help others at www.naturalhope.org hope it helps stay positive", "Ask about IV nutrition"],
        "date": "9/26/19"
    },
    {
        "id": 21,
        "question": "I am feeling helpless today. My hubby finished his last round of radiation and last night while we were in bed I was rubbing his head ( a nightly ritual, do to his headaches) his hair was coming out in my hands. I told him I was sorry and that I love him no matter what. He starts chemo on Thursday. Just feeling a little helpless right now but will do anything and everything he wants to make him comfortable.",
        "comment": ["Keep doing what you are doing for your warrior. My husband went ahead and shaved his head before chemo started so that he wouldnt notice if/when fell out. Just suggestion and I really like it"],
        "date": "10/8/19"
    },
    {
        "id": 22,
        "question": "she was recently diagnosed with NSCLC Adenocarcinoma Stage IIB. Lung removal is not an option because she has COPD, so Friday she will begin her first chemo(carboplatin/pemetrexed) of 4. One every 21 days, and radiation everyday. She is very nervous and doesn’t know what to expect, but we are all ready to get this fight started! She is very devastated about losing her hair, so we are trying our hardest to ease her anxiety, and will be looking in to getting her a wig",
        "comment": ["Someone suggested cold caps to me. You may want to look into it. It's rather expensive though", "Tell her not to panic. My husband had carboplatin/alimta/Keytruda 4 months before stepping downt to alimta/Keytruda now just Keytruda. His hair got pretty thin but he didn't lose it all. It grew back thick and and a beautiful red like it was when he was young. Prayers that everything goes great for her.", "My hair got thin on that combo but I still had plenty. I bought a wig to be ready and it’s still in the bag. Good luck!", "My husband was diagnosed with 3b adenocarcinoma NSC. Exact treatment, didn’t loose his hair, but it did turn darker and curly in the back!", "Courage, there are services in hospital that offer wigs identical to yr own hair. I would go for real hair and not artificial more expensive of course", "I'm on the same Chemo and I've lost my hair , though some places where you go have wigs right where you get treatment. I did get mine (Charity) it made me smile.", "I had the same Chemo but a mine was every week. Nurses told me it was a high dose so I trust them. I was already taking Biotin for my hair before I got diagnosed. I did lose a good bit, but mostly it was in my length. Your mom will do great."],
        "date": "5/6/19"
    },
]

